package chn.bhmc.dms.sal.cmm.service.impl;

import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.ResultSet;
import java.sql.ResultSetMetaData;
import java.sql.SQLException;
import java.sql.Statement;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.Map;

import able.com.service.HService;

import org.apache.commons.lang3.StringUtils;
import org.springframework.stereotype.Service;

import chn.bhmc.dms.sal.cmm.service.SalesSQLLabService;

/**
 * @ClassName   : SalesSQLLabServiceImpl
 * @Description : 판매 공통
 * @author KIM JINSUK
 * @since 2018. 01. 08.
 * @version 1.0
 * @Modification Information
 * <pre>
 *     since          author              description
 *  ===========    =============    ===========================
 *  2018. 01. 08.      KIM JINSUK            최초 생성
 * </pre>
 */

@Service("salesSQLLabService")
public class SalesSQLLabServiceImpl extends HService implements SalesSQLLabService {

    private String dlrIps[][] = {
            /* 개발 */
            /*
            {"D1818","10.125.211.117"}
            ,{"D0103","10.125.211.115"}
            */

              /* 운영 508개 딜러 */
            {"D0102","172.25.220.10"}
            ,{"D0105","172.25.77.10"}
            ,{"D0108","172.25.178.10"}
            ,{"D0110","172.25.93.10"}
            ,{"D0111","172.25.42.10"}
            ,{"D0115","172.25.127.10"}
            ,{"D0116","172.25.146.10"}
            ,{"D0117","172.25.62.10"}
            ,{"D0118","172.25.120.10"}
            ,{"D0119","172.25.0.11"}
            ,{"D0120","172.25.137.10"}
            ,{"D0121","172.25.158.10"}
            ,{"D0123","172.25.181.10"}
            ,{"D0124","172.25.128.10"}
            ,{"D0126","172.25.123.10"}
            ,{"D0129","172.25.43.10"}
            ,{"D0130","172.25.102.10"}
            ,{"D0203","172.25.83.10"}
            ,{"D0205","172.25.81.10"}
            ,{"D0213","172.25.202.10"}
            ,{"D0216","172.25.79.10"}
            ,{"D0220","172.25.80.10"}
            ,{"D0221","172.24.97.10"}
            ,{"D0222","172.24.4.10"}
            ,{"D0223","172.25.97.10"}
            ,{"D0225","172.25.38.10"}
            ,{"D0226","172.25.204.10"}
            ,{"D0301","172.25.12.10"}
            ,{"D0303","172.23.19.10"}
            ,{"D0304","172.24.185.10"}
            ,{"D0309","172.23.41.10"}
            ,{"D0310","172.24.86.10"}
            ,{"D0311","172.24.167.10"}
            ,{"D0312","172.25.213.10"}
            ,{"D0401","172.25.95.10"}
            ,{"D0403","172.25.108.10"}
            ,{"D0405","172.25.234.10"}
            ,{"D0406","172.25.239.10"}
            ,{"D0407","172.25.154.10"}
            ,{"D0410","172.25.117.10"}
            ,{"D0412","172.25.144.10"}
            ,{"D0413","172.25.170.10"}
            ,{"D1003","172.24.110.10"}
            ,{"D1004","172.27.109.10"}
            ,{"D1005","172.24.211.10"}
            ,{"D1006","172.23.117.10"}
            ,{"D1007","172.23.13.10"}
            ,{"D1008","172.23.28.10"}
            ,{"D1009","172.25.30.10"}
            ,{"D1011","172.25.225.10"}
            ,{"D1015","172.25.31.10"}
            ,{"D1017","172.24.129.10"}
            ,{"D1018","172.25.255.10"}
            ,{"D1019","172.28.113.10"}
            ,{"D1021","172.24.203.10"}
            ,{"D1022","172.24.232.10"}
            ,{"D1023","172.25.248.10"}
            ,{"D1024","172.24.190.10"}
            ,{"D1025","172.24.46.10"}
            ,{"D1026","172.25.206.10"}
            ,{"D1027","172.24.195.10"}
            ,{"D1028","172.24.130.10"}
            ,{"D1034","172.24.208.10"}
            ,{"D1036","172.25.65.10"}
            ,{"D1042","172.24.226.10"}
            ,{"D1043","172.23.116.10"}
            ,{"D1044","172.23.3.10"}
            ,{"D1046","172.24.69.10"}
            ,{"D1047","172.24.119.10"}
            ,{"D1049","172.23.88.10"}
            ,{"D1050","172.24.120.10"}
            ,{"D1053","172.24.121.10"}
            ,{"D1055","172.25.32.10"}
            ,{"D1056","172.25.199.10"}
            ,{"D1059","172.25.33.10"}
            ,{"D1060","172.23.84.10"}
            ,{"D1061","172.24.71.10"}
            ,{"D1062","172.24.53.10"}
            ,{"D1068","172.24.103.10"}
            ,{"D1070","172.24.212.10"}
            ,{"D1075","172.24.56.10"}
            ,{"D1076","172.24.73.10"}
            ,{"D1085","172.25.238.10"}
            ,{"D1088","172.24.205.10"}
            ,{"D1089","172.24.236.10"}
            ,{"D1090","172.24.83.10"}
            ,{"D1093","172.24.239.10"}
            ,{"D1094","172.24.180.10"}
            ,{"D1096","172.23.15.10"}
            ,{"D1097","172.24.131.10"}
            ,{"D1098","172.24.132.10"}
            ,{"D1101","172.25.175.10"}
            ,{"D1102","172.29.142.10"}
            ,{"D1103","172.25.109.10"}
            ,{"D1104","172.25.161.10"}
            ,{"D1106","172.29.185.10"}
            ,{"D1108","172.23.0.10"}
            ,{"D1109","172.25.111.10"}
            ,{"D1110","172.25.114.10"}
            ,{"D1111","172.27.20.10"}
            ,{"D1112","172.25.124.10"}
            ,{"D1113","172.29.175.10"}
            ,{"D1115","172.25.143.10"}
            ,{"D1116","172.24.23.10"}
            ,{"D1120","172.25.155.10"}
            ,{"D1122","172.25.228.10"}
            ,{"D1123","172.27.133.10"}
            ,{"D1124","172.25.240.10"}
            ,{"D1125","172.25.112.10"}
            ,{"D1127","172.28.114.10"}
            ,{"D1128","172.25.156.10"}
            ,{"D1131","172.25.179.10"}
            ,{"D1132","172.24.148.10"}
            ,{"D1133","172.25.193.10"}
            ,{"D1134","172.24.78.10"}
            ,{"D1135","172.26.42.10"}
            ,{"D1138","172.24.62.10"}
            ,{"D1139","172.24.43.10"}
            ,{"D1140","172.25.115.10"}
            ,{"D1141","172.24.21.10"}
            ,{"D1142","172.24.133.10"}
            ,{"D1143","172.24.9.10"}
            ,{"D1144","172.25.157.10"}
            ,{"D1146","172.24.3.10"}
            ,{"D1147","172.25.107.10"}
            ,{"D1148","172.24.31.10"}
            ,{"D1149","172.24.134.10"}
            ,{"D1150","172.24.220.10"}
            ,{"D1152","172.25.164.10"}
            ,{"D1154","172.25.133.10"}
            ,{"D1155","172.25.147.10"}
            ,{"D1156","172.24.18.10"}
            ,{"D1158","172.24.122.10"}
            ,{"D1159","172.25.180.10"}
            ,{"D1161","172.24.32.10"}
            ,{"D1164","172.24.30.10"}
            ,{"D1166","172.25.247.10"}
            ,{"D1168","172.24.40.10"}
            ,{"D1169","172.25.138.10"}
            ,{"D1171","172.24.52.10"}
            ,{"D1172","172.25.188.10"}
            ,{"D1173","172.25.34.10"}
            ,{"D1174","172.25.135.10"}
            ,{"D1175","172.25.230.10"}
            ,{"D1176","172.25.171.10"}
            ,{"D1177","172.25.136.10"}
            ,{"D1178","172.24.88.10"}
            ,{"D1180","172.24.7.10"}
            ,{"D1183","172.25.182.10"}
            ,{"D1186","172.25.37.10"}
            ,{"D1187","172.24.157.10"}
            ,{"D1188","172.25.35.10"}
            ,{"D1189","172.24.5.10"}
            ,{"D1201","172.25.6.10"}
            ,{"D1203","172.29.92.10"}
            ,{"D1204","172.25.75.10"}
            ,{"D1205","172.25.211.10"}
            ,{"D1206","172.25.40.10"}
            ,{"D1208","172.23.120.10"}
            ,{"D1209","172.24.210.10"}
            ,{"D1215","172.23.103.10"}
            ,{"D1216","172.24.183.10"}
            ,{"D1218","172.23.58.10"}
            ,{"D1219","172.24.135.10"}
            ,{"D1228","172.25.73.10"}
            ,{"D1230","172.24.156.10"}
            ,{"D1232","172.26.2.10"}
            ,{"D1234","172.29.36.10"}
            ,{"D1235","172.25.39.10"}
            ,{"D1236","172.23.122.10"}
            ,{"D1237","172.24.91.10"}
            ,{"D1244","172.23.80.10"}
            ,{"D1246","172.24.249.10"}
            ,{"D1247","172.23.51.10"}
            ,{"D1248","172.24.186.10"}
            ,{"D1249","172.23.14.10"}
            ,{"D1250","172.25.64.10"}
            ,{"D1252","172.24.178.10"}
            ,{"D1253","172.24.215.10"}
            ,{"D1254","172.23.37.10"}
            ,{"D1256","172.24.189.10"}
            ,{"D1259","172.24.136.10"}
            ,{"D1260","172.24.204.10"}
            ,{"D1263","172.24.245.10"}
            ,{"D1264","172.24.206.10"}
            ,{"D1268","172.24.247.10"}
            ,{"D1271","172.24.207.10"}
            ,{"D1272","172.24.188.10"}
            ,{"D1277","172.24.216.10"}
            ,{"D1283","172.25.74.10"}
            ,{"D1301","172.25.227.10"}
            ,{"D1302","172.25.91.10"}
            ,{"D1303","172.25.22.10"}
            ,{"D1304","172.29.168.10"}
            ,{"D1305","172.25.92.10"}
            ,{"D1307","172.25.101.10"}
            ,{"D1309","172.23.10.10"}
            ,{"D1310","172.25.87.10"}
            ,{"D1311","172.25.141.10"}
            ,{"D1312","172.25.90.10"}
            ,{"D1313","172.25.116.10"}
            ,{"D1314","172.25.140.10"}
            ,{"D1315","172.25.110.10"}
            ,{"D1317","172.25.130.10"}
            ,{"D1318","172.25.25.10"}
            ,{"D1320","172.25.222.10"}
            ,{"D1321","172.25.131.10"}
            ,{"D1322","172.25.166.10"}
            ,{"D1323","172.25.113.10"}
            ,{"D1324","172.25.122.10"}
            ,{"D1325","172.25.125.10"}
            ,{"D1326","172.25.118.10"}
            ,{"D1327","172.25.85.10"}
            ,{"D1329","172.25.121.10"}
            ,{"D1330","172.25.132.10"}
            ,{"D1332","172.25.139.10"}
            ,{"D1333","172.30.119.46"}
            ,{"D1334","172.25.119.10"}
            ,{"D1335","172.25.94.10"}
            ,{"D1401","172.25.71.10"}
            ,{"D1402","172.28.5.20"}
            ,{"D1407","172.23.54.10"}
            ,{"D1408","172.24.123.10"}
            ,{"D1411","172.23.67.10"}
            ,{"D1416","172.23.189.10"}
            ,{"D1418","172.24.159.10"}
            ,{"D1420","172.26.37.10"}
            ,{"D1421","172.24.173.10"}
            ,{"D1422","172.23.36.10"}
            ,{"D1423","172.26.41.10"}
            ,{"D1424","172.23.4.10"}
            ,{"D1426","172.24.218.10"}
            ,{"D1427","172.25.4.10"}
            ,{"D1434","172.23.44.10"}
            ,{"D1436","172.25.26.10"}
            ,{"D1439","172.24.250.10"}
            ,{"D1441","172.25.27.10"}
            ,{"D1443","172.24.192.10"}
            ,{"D1446","172.23.6.10"}
            ,{"D1447","172.25.29.10"}
            ,{"D1452","172.24.238.10"}
            ,{"D1462","172.24.251.10"}
            ,{"D1466","172.24.104.10"}
            ,{"D1467","172.25.201.10"}
            ,{"D1469","172.24.198.10"}
            ,{"D1470","172.24.235.10"}
            ,{"D1501","172.25.149.10"}
            ,{"D1502","172.25.129.10"}
            ,{"D1504","172.25.9.10"}
            ,{"D1505","172.25.153.10"}
            ,{"D1506","172.25.134.10"}
            ,{"D1507","172.25.210.10"}
            ,{"D1508","172.25.163.10"}
            ,{"D1509","172.25.160.10"}
            ,{"D1510","172.25.187.10"}
            ,{"D1511","172.24.105.10"}
            ,{"D1512","172.24.22.10"}
            ,{"D1513","172.25.145.10"}
            ,{"D1514","172.25.176.10"}
            ,{"D1515","172.25.185.10"}
            ,{"D1517","172.25.203.10"}
            ,{"D1518","172.25.173.10"}
            ,{"D1519","172.25.24.10"}
            ,{"D1520","172.25.186.10"}
            ,{"D1522","172.24.15.10"}
            ,{"D1523","172.25.191.10"}
            ,{"D1525","172.24.16.10"}
            ,{"D1527","172.24.2.10"}
            ,{"D1528","172.25.183.10"}
            ,{"D1529","172.25.162.10"}
            ,{"D1530","172.24.24.10"}
            ,{"D1531","172.25.174.10"}
            ,{"D1532","172.24.1.10"}
            ,{"D1533","172.25.159.10"}
            ,{"D1534","172.24.77.10"}
            ,{"D1535","172.25.224.10"}
            ,{"D1601","172.23.47.10"}
            ,{"D1603","172.23.18.10"}
            ,{"D1605","172.25.18.10"}
            ,{"D1606","172.24.85.10"}
            ,{"D1608","172.25.216.10"}
            ,{"D1610","172.24.213.10"}
            ,{"D1611","172.24.99.10"}
            ,{"D1613","172.23.63.10"}
            ,{"D1617","172.24.240.10"}
            ,{"D1701","172.25.7.10"}
            ,{"D1702","172.25.13.10"}
            ,{"D1706","172.23.102.10"}
            ,{"D1708","172.24.153.10"}
            ,{"D1711","172.24.191.10"}
            ,{"D1716","172.25.11.10"}
            ,{"D1718","172.23.17.10"}
            ,{"D1719","172.24.243.10"}
            ,{"D1726","172.24.217.10"}
            ,{"D1733","172.24.125.10"}
            ,{"D1742","172.25.208.10"}
            ,{"D1801","172.24.106.10"}
            ,{"D1802","172.25.242.10"}
            ,{"D1804","172.24.246.10"}
            ,{"D1807","172.23.5.10"}
            ,{"D1811","172.24.182.10"}
            ,{"D1816","172.25.19.10"}
            ,{"D1819","172.24.82.10"}
            ,{"D1902","172.25.54.10"}
            ,{"D1905","172.24.111.10"}
            ,{"D2002","172.25.41.10"}
            ,{"D2003","172.25.56.10"}
            ,{"D2004","172.24.184.10"}
            ,{"D2008","172.24.219.10"}
            ,{"D2019","172.25.244.10"}
            ,{"D2023","172.24.112.10"}
            ,{"D2026","172.24.166.10"}
            ,{"D2102","172.24.200.10"}
            ,{"D2105","172.25.152.10"}
            ,{"D2107","172.29.120.10"}
            ,{"D2108","172.25.150.10"}
            ,{"D2110","172.24.201.10"}
            ,{"D2112","172.23.49.10"}
            ,{"D2114","172.25.16.10"}
            ,{"D2115","172.25.17.10"}
            ,{"D2117","172.25.250.10"}
            ,{"D2118","172.24.113.10"}
            ,{"D2120","172.24.79.10"}
            ,{"D2127","172.24.170.10"}
            ,{"D2128","172.29.63.10"}
            ,{"D2129","172.23.24.10"}
            ,{"D2133","172.25.232.10"}
            ,{"D2134","172.25.100.10"}
            ,{"D2135","172.26.59.20"}
            ,{"D2137","172.24.202.10"}
            ,{"D2138","172.24.174.10"}
            ,{"D2139","172.23.7.10"}
            ,{"D2140","172.24.222.10"}
            ,{"D2141","172.24.137.10"}
            ,{"D2142","172.24.234.10"}
            ,{"D2143","172.24.233.10"}
            ,{"D2144","172.24.229.10"}
            ,{"D2145","172.24.138.10"}
            ,{"D2148","172.24.139.10"}
            ,{"D2149","172.25.237.10"}
            ,{"D2153","172.24.244.10"}
            ,{"D2155","172.24.199.10"}
            ,{"D2157","172.24.228.10"}
            ,{"D2158","172.24.114.10"}
            ,{"D2160","172.24.126.10"}
            ,{"D2163","172.23.77.10"}
            ,{"D2166","172.24.179.10"}
            ,{"D2171","172.25.200.10"}
            ,{"D2201","172.24.36.10"}
            ,{"D2205","172.23.125.10"}
            ,{"D2206","172.24.96.10"}
            ,{"D2207","172.24.35.10"}
            ,{"D2208","172.24.60.10"}
            ,{"D2209","172.25.21.10"}
            ,{"D2210","172.24.45.10"}
            ,{"D2211","172.24.48.10"}
            ,{"D2213","172.24.194.10"}
            ,{"D2215","172.24.67.10"}
            ,{"D2216","172.25.236.10"}
            ,{"D2217","172.24.197.10"}
            ,{"D2218","172.25.23.10"}
            ,{"D2219","172.24.58.10"}
            ,{"D2225","172.25.198.10"}
            ,{"D2226","172.24.146.10"}
            ,{"D2301","172.25.212.10"}
            ,{"D2302","172.30.151.10"}
            ,{"D2304","172.23.12.10"}
            ,{"D2305","172.23.118.10"}
            ,{"D2306","172.27.203.10"}
            ,{"D2307","172.25.20.10"}
            ,{"D2308","172.24.0.10"}
            ,{"D2309","172.25.67.10"}
            ,{"D2311","172.24.42.10"}
            ,{"D2312","172.23.126.10"}
            ,{"D2313","172.25.254.10"}
            ,{"D2314","172.25.241.10"}
            ,{"D2316","172.24.14.10"}
            ,{"D2317","172.25.104.10"}
            ,{"D2319","172.25.235.10"}
            ,{"D2320","172.24.26.10"}
            ,{"D2321","172.24.12.10"}
            ,{"D2322","172.24.64.10"}
            ,{"D2323","172.24.19.10"}
            ,{"D2325","172.24.39.10"}
            ,{"D2327","172.25.8.10"}
            ,{"D2328","172.24.66.10"}
            ,{"D2330","172.24.63.10"}
            ,{"D2331","172.24.51.10"}
            ,{"D2332","172.24.34.10"}
            ,{"D2333","172.24.44.10"}
            ,{"D2334","172.24.57.10"}
            ,{"D2402","172.25.14.10"}
            ,{"D2501","172.25.233.10"}
            ,{"D2502","172.25.46.10"}
            ,{"D2503","172.23.115.10"}
            ,{"D2511","172.24.140.10"}
            ,{"D2601","172.25.61.10"}
            ,{"D2602","172.24.80.10"}
            ,{"D2604","172.25.218.10"}
            ,{"D2605","172.24.164.10"}
            ,{"D2606","172.23.121.10"}
            ,{"D2607","172.25.105.10"}
            ,{"D2608","172.24.115.10"}
            ,{"D2609","172.24.107.10"}
            ,{"D2611","172.25.223.10"}
            ,{"D2614","172.25.221.10"}
            ,{"D2617","172.25.219.10"}
            ,{"D2619","172.25.47.10"}
            ,{"D2702","172.25.5.10"}
            ,{"D2705","172.25.48.10"}
            ,{"D2706","172.24.75.10"}
            ,{"D2707","172.23.20.10"}
            ,{"D2708","172.29.158.10"}
            ,{"D2710","172.24.90.10"}
            ,{"D2712","172.24.255.10"}
            ,{"D2714","172.26.50.10"}
            ,{"D2719","172.23.16.10"}
            ,{"D2724","172.24.227.10"}
            ,{"D2729","172.24.171.10"}
            ,{"D2730","172.24.223.10"}
            ,{"D2731","172.24.54.10"}
            ,{"D2732","172.25.243.10"}
            ,{"D2801","172.24.93.10"}
            ,{"D2802","172.25.167.10"}
            ,{"D2803","172.29.103.10"}
            ,{"D2804","172.25.10.10"}
            ,{"D2806","172.25.44.10"}
            ,{"D2807","172.25.45.10"}
            ,{"D2810","172.25.249.10"}
            ,{"D2811","172.24.20.10"}
            ,{"D2812","172.25.231.10"}
            ,{"D2813","172.24.11.10"}
            ,{"D2814","172.24.149.10"}
            ,{"D2815","172.25.194.10"}
            ,{"D2817","172.24.92.10"}
            ,{"D2819","172.23.2.10"}
            ,{"D2820","172.24.17.10"}
            ,{"D2822","172.24.25.10"}
            ,{"D2823","172.25.126.10"}
            ,{"D2825","172.25.72.10"}
            ,{"D2826","172.24.193.10"}
            ,{"D2827","172.24.47.10"}
            ,{"D2828","172.25.189.10"}
            ,{"D2829","172.25.192.10"}
            ,{"D2834","172.24.116.10"}
            ,{"D2836","172.24.59.10"}
            ,{"D2837","172.24.29.10"}
            ,{"D2839","172.24.37.10"}
            ,{"D2842","172.24.117.10"}
            ,{"D2845","172.25.190.10"}
            ,{"D2846","172.25.148.10"}
            ,{"D2847","172.25.172.10"}
            ,{"D2848","172.24.61.10"}
            ,{"D2853","172.24.65.10"}
            ,{"D2856","172.24.8.10"}
            ,{"D2857","172.24.27.10"}
            ,{"D2858","172.25.96.10"}
            ,{"D2859","172.24.6.10"}
            ,{"D2860","172.24.49.10"}
            ,{"D2861","172.24.41.10"}
            ,{"D2863","172.24.33.10"}
            ,{"D2864","172.25.3.10"}
            ,{"D2865","172.25.195.10"}
            ,{"D2901","172.25.49.10"}
            ,{"D2902","172.25.1.10"}
            ,{"D2903","172.25.50.10"}
            ,{"D2906","172.24.108.10"}
            ,{"D2907","172.24.100.10"}
            ,{"D2909","172.25.51.10"}
            ,{"D2910","172.24.118.10"}
            ,{"D2911","172.23.123.10"}
            ,{"D2915","172.24.81.10"}
            ,{"D2916","172.24.95.10"}
            ,{"D2918","172.24.84.10"}
            ,{"D2919","172.24.141.10"}
            ,{"D2923","172.24.142.10"}
            ,{"D2926","172.25.103.10"}
            ,{"D2927","172.24.252.10"}
            ,{"D2928","172.24.187.10"}
            ,{"D2929","172.24.237.10"}
            ,{"D2930","172.24.127.10"}
            ,{"D3001","172.24.196.10"}
            ,{"D3010","172.25.57.10"}
            ,{"D3105","172.24.253.10"}
            ,{"D3108","172.23.22.10"}
            ,{"D3117","172.25.55.10"}
            ,{"D3119","172.24.225.10"}
            ,{"D4001","172.24.143.10"}
            ,{"D4007","172.25.69.10"}
            ,{"D4020","172.23.81.10"}
            ,{"D4201","172.24.101.10"}
            ,{"D4202","172.25.66.10"}
            ,{"D4203","172.24.176.10"}
            ,{"D4207","172.24.241.10"}
            ,{"D4208","172.24.172.10"}
            ,{"D4210","172.24.242.10"}
            ,{"D4219","172.25.207.10"}
            ,{"D4302","172.24.169.10"}
            ,{"D4305","172.25.215.10"}
            ,{"D4309","172.25.52.10"}
            ,{"D4310","172.25.217.10"}
            ,{"D4315","172.24.102.10"}
            ,{"D4326","172.25.68.10"}
            ,{"D4403","172.25.53.10"}
            ,{"D4409","172.24.181.10"}
            ,{"D4502","172.23.119.10"}
            ,{"D4503","172.25.63.10"}
            ,{"D4505","172.23.43.10"}
    };

    /////////////////////////////////////////////////////////////
    // select SQL 테스트
    ////////////////////////////////////////////////////////////
    @Override
    public Map<String, ArrayList<?>> callSendSQLRun(String sSql)throws Exception{

        HashMap<String, ArrayList<?>> resultMap = new HashMap<String, ArrayList<?>>();
        ArrayList<String> noIpList   = new ArrayList<String>();     // 접속안된 IP리스트
        ArrayList<String> columnList = new ArrayList<String>();     // 헤더 컬럼정보
        ArrayList<HashMap<String,String>> rList = null;

        ArrayList<HashMap<String,String>> dataList = new ArrayList<HashMap<String,String>>();

        for(int i=0; i<dlrIps.length; i++){
            String dbIP = dlrIps[i][1];
            System.out.println("## ip["+i+"]-[ "+ dbIP + " ] DLR_CD : "+dlrIps[i][0]);

            // 최초 접속된 ip에서 컬럼헤더 정보만 받아온다.
            rList = runSQL(dbIP, sSql, columnList.size()==0?columnList:null);

            // 접속안된 리스트
            if(rList == null){
                noIpList.add(dbIP);
            }else{
                dataList.addAll(rList);
            }
        }

        resultMap.put("NoConnectIp", noIpList);
        resultMap.put("ColumnList", columnList);
        resultMap.put("DataSet", dataList);

        System.out.println("### [ end ] ###");

        return resultMap;

    }

    // 해당 IP로 딜러 코드 받아오기.
    // 멀티 딜러 유/무 판정 후   --
    private ArrayList<HashMap<String,String>> selectSysOwnDlrCd(Statement stmt) throws Exception{
        ArrayList<HashMap<String,String>> dlrList = new ArrayList<HashMap<String,String>>();

        ResultSet rs = null;
        String sSql = "SELECT DLR_CD" +
                      "     , DLR_NM" +
                      "  FROM CM_0101T" +
                      " WHERE SYS_OWNER_YN = 'Y'";
        try {
            rs = stmt.executeQuery(sSql);

            HashMap<String, String> map = null;
            while (rs.next()) {
                map = new HashMap<String, String>();
                map.put("DLR_CD", rs.getString("DLR_CD"));
                map.put("DLR_NM", rs.getString("DLR_NM"));
                dlrList.add(map);
            }
        } catch (SQLException e) {
            e.printStackTrace();
        } finally{
            try {
                // resultset 종료
                rs.close();
            } catch (SQLException e) {
                e.printStackTrace();
            }
        }

        return dlrList;
    }

    // 해당 IP로 딜러 코드 받아오기.
    // 멀티 딜러
    private ArrayList<HashMap<String,String>> selectSysMutiDlrCd(Statement stmt) throws Exception{
        ArrayList<HashMap<String,String>> dlrList = new ArrayList<HashMap<String,String>>();

        ResultSet rs = null;
        String sSql = "SELECT DLR_CD" +
                      "     , DLR_NM" +
                      "  FROM CM_0101T" +
                      " WHERE USE_CENTER_DMS_YN = 'Y'";
        try {
            rs = stmt.executeQuery(sSql);

            HashMap<String, String> map = null;
            while (rs.next()) {
                map = new HashMap<String, String>();
                map.put("DLR_CD", rs.getString("DLR_CD"));
                map.put("DLR_NM", rs.getString("DLR_NM"));
                dlrList.add(map);
            }
        } catch (SQLException e) {
            e.printStackTrace();
        } finally{
            try {
                rs.close();
            } catch (SQLException e) {
                e.printStackTrace();
            }
        }

        return dlrList;
    }


    private ArrayList<HashMap<String,String>> selectSQL(Statement stmt, String dlrCd, String sSql, ArrayList<String> columnList){
        ArrayList<HashMap<String,String>> List = null;
        ResultSet rs = null;

        try {
            rs = stmt.executeQuery(sSql.replace("$DLR_CD", dlrCd));

            ResultSetMetaData meta = rs.getMetaData();
            int cLength = meta.getColumnCount();  // 컬럼수

            String[] cols = new String[cLength];
            for(int i=0; i<cLength; i++){
                //cols[i] = meta.getColumnClassName(i+1);       //컬럼 형체크
                cols[i] = meta.getColumnName(i+1);              //컬럼명

                if(columnList != null){
                    columnList.add(cols[i]);
                }
            }

            HashMap<String, String> row = null;
            List = new ArrayList<HashMap<String,String>>();

            while (rs.next()) {
                row = new HashMap<String, String>();
                for (int i=0; i<cLength; i++) {
                    row.put(cols[i], rs.getString(i+1));

                }

                row.put("DLR_CD", dlrCd);

                List.add(row);
            }


        } catch (SQLException e) {
            e.printStackTrace();
        } finally{
            try {
                // resultset 종료
                rs.close();
            } catch (SQLException e) {
                e.printStackTrace();
            }
        }

        return List;
    }



    public ArrayList<HashMap<String,String>> runSQL(String dbIP, String sSql, ArrayList<String> columnList){
       Connection conn = null;
       try{
           conn = dbConnection(dbIP);
       }catch(Exception e){
           //e.printStackTrace();
           System.out.println("#"+e.getMessage());
           return null;
       }

        Statement stmt = null;
        ArrayList<HashMap<String,String>> List = null;

        ArrayList<HashMap<String, String>> ownList = null;
        ArrayList<HashMap<String,String>> MultisResultList = null;
        try {
            stmt = conn.createStatement();

            ownList = selectSysOwnDlrCd(stmt);

            if(ownList.size() > 0){
                // 단일딜러.
                HashMap<String, String> ownMap = (HashMap<String, String>)ownList.get(0);
                List = selectSQL(stmt, (String)ownMap.get("DLR_CD"), sSql, columnList);
            }else{

                // 멀티딜러.
                MultisResultList = new ArrayList<HashMap<String,String>>();
                ArrayList<HashMap<String, String>>  MultiList = selectSysMutiDlrCd(stmt);

                for(HashMap<String, String> dlrMap  : MultiList){
                    List = selectSQL(stmt, (String)dlrMap.get("DLR_CD"), sSql, columnList);

                    if(List != null && List.size() > 0){
                        MultisResultList.addAll(List);
                    }
                }
            }

        } catch (SQLException e) {
            e.printStackTrace();
        } catch (Exception e) {
            e.printStackTrace();
        } finally {
            try {
                // resultset 종료
                //rs.close();

                // Statement 종료
                stmt.close();
                // Connection 종료
                conn.close();

            } catch (SQLException e) {
                e.printStackTrace();
            }
        }
        return ownList.size()>0?List:MultisResultList;
    }// run SQL 종료


    // DB 접속
    public Connection dbConnection(String dlrIP) throws Exception{
        Connection conn = null;

        String url = "jdbc:tibero:thin:@"+dlrIP+":8629:BHDMS";
        String user = "DMSDB";
        String password = "DMSDB_#01";

        // 1. Driver
        try {
            //Class.forName("oracle.jdbc.driver.OracleDriver");
            Class.forName("com.tmax.tibero.jdbc.TbDriver");

        // 2. Connection DB (URL, ID, P/W)
            conn = DriverManager.getConnection(url, user, password);
        } catch (ClassNotFoundException e) {
            throw e;
        } catch (SQLException e) {
            throw e;
        }catch (Exception e) {
            throw e;
        }

        return conn;
    }

    // insert or update
    @Override
    public Map<String, ArrayList<?>> callSendUpdateSQL(String sSql)throws Exception{

        HashMap<String, ArrayList<?>> resultMap = new HashMap<String, ArrayList<?>>();
        ArrayList<String> noIpList   = new ArrayList<String>();     // 접속안된 IP리스트
        ArrayList<String> columnList = new ArrayList<String>();     // 헤더 컬럼정보
        columnList.add("DLR_CD");
        columnList.add("RESULT");

        ArrayList<HashMap<String,String>> dataList = new ArrayList<HashMap<String,String>>();

        String dbResult = "";
        HashMap<String,String> dlrMap = null;

        for(int i=0; i<dlrIps.length; i++){
            String dbIP = dlrIps[i][1];
            System.out.println("## ip["+i+"] : "+ dbIP);

            String sDlrCd = dlrIps[i][0];
            System.out.println("## dlrCd["+i+"] : "+ sDlrCd);
            dbResult = runUpdateSQL(dbIP, sSql.replace("$DLR_CD", sDlrCd));

            // 접속안된 리스트
            if(StringUtils.isBlank(dbResult)){
                noIpList.add(dbIP);
            }else{
                dlrMap = new HashMap<String,String>();
                dlrMap.put("DLR_CD", dbIP);
                dlrMap.put("RESULT", dbResult);
                dataList.add(dlrMap);
            }
        }
        resultMap.put("NoConnectIp", noIpList);
        resultMap.put("ColumnList", columnList);
        resultMap.put("DataSet", dataList);

        return resultMap;
    }


    private String runUpdateSQL(String dbIP, String sSql){
        Connection conn = null;
        try{
            conn = dbConnection(dbIP);
        }catch(Exception e){
            System.out.println("#"+e.getMessage());
            return null;
        }

        int rs = -1;
        Statement stmt = null;

        try {
            stmt = conn.createStatement();

            rs = stmt.executeUpdate(sSql);

        } catch (SQLException e) {
            e.printStackTrace();
        } catch (Exception e) {
            e.printStackTrace();
        } finally {
            try {
                // Statement 종료
                stmt.close();
                // Connection 종료
                conn.close();
            } catch (SQLException e) {
                e.printStackTrace();
            }
        }

        System.out.println("# UPDATE RESULT END : "+ rs);


        return String.valueOf(rs);
    }

    // 특수문자 컴버젼
    /*
    private String  cconvertEscape(String rs){
        String result = "";
        StringUtils.isEmpty(cs);
        return rs.replaceAll("(", "_");

    }
    */

    /**
     * 에러 처리
     */
    @Override
    public void setException(String msgKey, String[] msgKey2)throws Exception{
        throw processException(msgKey, msgKey2);
    }



}